# GetIntegerValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..GetIntegerValue Method
ScheduleFilter Class See Also
---
Gets the filter value for a filter using an integer value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetIntegerValue()
```

Visual Basic
---
```text
Public Function GetIntegerValue As Integer
```

Visual C++
---
```text
public:
int GetIntegerValue()
```

# ### Return Value
The filter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The filter value is not an integer. |

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace